; ModuleID = '/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/b-eAaNsk.bc'
source_filename = "llvm-link"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.11.0"

%struct.s2n_hmac_state = type { i32, i16, i32, i16, i8, %struct.s2n_hash_state, %struct.s2n_hash_state, %struct.s2n_hash_state, %struct.s2n_hash_state, [128 x i8], [64 x i8] }
%struct.s2n_hash_state = type { i32, i32 }
%struct.s2n_crypto_parameters = type { %struct.s2n_pkey, %struct.s2n_pkey, %struct.s2n_dh_params, %struct.s2n_ecc_params, %struct.s2n_cert_chain_and_key*, i32, i32, %struct.s2n_blob, i32, i32, i32, %struct.s2n_cipher_suite*, %struct.s2n_session_key, %struct.s2n_session_key, [48 x i8], [48 x i8], [32 x i8], [32 x i8], [16 x i8], [16 x i8], %struct.s2n_hash_state, %struct.s2n_hmac_state, %struct.s2n_hmac_state, %struct.s2n_hmac_state, [8 x i8], [8 x i8] }
%struct.s2n_pkey = type { %union.anon, i32 (%struct.s2n_pkey*, %struct.s2n_hash_state*, %struct.s2n_blob*)*, i32 (%struct.s2n_pkey*, %struct.s2n_hash_state*, %struct.s2n_blob*)*, i32 (%struct.s2n_pkey*, %struct.s2n_blob*, %struct.s2n_blob*)*, i32 (%struct.s2n_pkey*, %struct.s2n_blob*, %struct.s2n_blob*)*, i32 (%struct.s2n_pkey*, %struct.s2n_pkey*)*, i32 (%struct.s2n_pkey*)* }
%union.anon = type { %struct.s2n_rsa_key }
%struct.s2n_rsa_key = type { %struct.rsa_st* }

!38 = !DIEnumerator(name: "S2N_CERT_TYPE_DSS_SIGN", value: 2)
!39 = !DIEnumerator(name: "S2N_CERT_TYPE_RSA_FIXED_DH", value: 3)
!40 = !DIEnumerator(name: "S2N_CERT_TYPE_DSS_FIXED_DH", value: 4)
!41 = !DIEnumerator(name: "S2N_CERT_TYPE_RSA_EPHEMERAL_DH_RESERVED", value: 5)
!42 = !DIEnumerator(name: "S2N_CERT_TYPE_DSS_EPHEMERAL_DH_RESERVED", value: 6)
!43 = !DIEnumerator(name: "S2N_CERT_TYPE_FORTEZZA_DMS_RESERVED", value: 20)
!44 = !DIEnumerator(name: "S2N_CERT_TYPE_ECDSA_SIGN", value: 64)
!45 = !DIEnumerator(name: "S2N_CERT_TYPE_RSA_FIXED_ECDH", value: 65)
!46 = !DIEnumerator(name: "S2N_CERT_TYPE_ECDSA_FIXED_ECDH", value: 66)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 19, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../crypto/s2n_signature.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "S2N_SIGNATURE_ANONYMOUS", value: 0)
!51 = !DIEnumerator(name: "S2N_SIGNATURE_RSA", value: 1)
!52 = !DIEnumerator(name: "S2N_SIGNATURE_DSA", value: 2)
!53 = !DIEnumerator(name: "S2N_SIGNATURE_ECDSA", value: 3)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 83, size: 32, align: 32, elements: !55)
!55 = !{!56, !57}
!56 = !DIEnumerator(name: "S2N_STATUS_REQUEST_NONE", value: 0)
!57 = !DIEnumerator(name: "S2N_STATUS_REQUEST_OCSP", value: 1)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 85, size: 32, align: 32, elements: !59)
!59 = !{!60, !61}
!60 = !DIEnumerator(name: "S2N_CT_SUPPORT_NONE", value: 0)
!61 = !DIEnumerator(name: "S2N_CT_SUPPORT_REQUEST", value: 1)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 136, size: 32, align: 32, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIEnumerator(name: "S2N_CERT_AUTH_NONE", value: 0)
!65 = !DIEnumerator(name: "S2N_CERT_AUTH_REQUIRED", value: 1)
!66 = !DIEnumerator(name: "S2N_CERT_AUTH_OPTIONAL", value: 2)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 137, size: 32, align: 32, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74}
!69 = !DIEnumerator(name: "S2N_CERT_OK", value: 0)
!70 = !DIEnumerator(name: "S2N_CERT_ERR_UNTRUSTED", value: -1)
!71 = !DIEnumerator(name: "S2N_CERT_ERR_REVOKED", value: -2)
!72 = !DIEnumerator(name: "S2N_CERT_ERR_EXPIRED", value: -3)
!73 = !DIEnumerator(name: "S2N_CERT_ERR_TYPE_UNSUPPORTED", value: -4)
!74 = !DIEnumerator(name: "S2N_CERT_ERR_INVALID", value: -5)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 92, size: 32, align: 32, elements: !76)
!76 = !{!77, !78}
!77 = !DIEnumerator(name: "S2N_SERVER", value: 0)
!78 = !DIEnumerator(name: "S2N_CLIENT", value: 1)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 117, size: 32, align: 32, elements: !80)
!80 = !{!81, !82}
!81 = !DIEnumerator(name: "S2N_BUILT_IN_BLINDING", value: 0)
!82 = !DIEnumerator(name: "S2N_SELF_SERVICE_BLINDING", value: 1)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !85, file: !84, line: 122, size: 32, align: 32, elements: !926)
!84 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../tls/s2n_connection.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_connection", file: !84, line: 41, size: 32128, align: 64, elements: !86)
!86 = !{!87, !450, !451, !458, !463, !464, !465, !466, !467, !469, !471, !476, !477, !481, !482, !483, !484, !485, !486, !487, !706, !707, !709, !710, !857, !858, !859, !861, !872, !873, !874, !875, !879, !881, !882, !883, !884, !885, !886, !887, !911, !912, !913, !914, !915, !918, !919, !920, !921, !922, !923, !924, !925}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !85, file: !84, line: 43, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_config", file: !90, line: 26, size: 1344, align: 64, elements: !91)
!90 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../tls/s2n_config.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!91 = !{!92, !235, !397, !401, !402, !404, !412, !413, !419, !420, !424, !425, !429, !430, !434, !435, !437, !439, !447, !448, !449}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dhparams", scope: !89, file: !90, line: 27, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_dh_params", file: !95, line: 24, size: 64, align: 64, elements: !96)
!95 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../crypto/s2n_dhe.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dh", scope: !94, file: !95, line: 25, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH", file: !100, line: 140, baseType: !101)
!100 = !DIFile(filename: "/usr/local/include/openssl/ossl_typ.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_st", file: !102, line: 135, size: 1152, align: 64, elements: !103)
!102 = !DIFile(filename: "/usr/local/include/openssl/dh.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!103 = !{!104, !106, !107, !120, !121, !123, !124, !125, !126, !140, !141, !142, !145, !146, !147, !148, !176, !231}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !101, file: !102, line: 140, baseType: !105, size: 32, align: 32)
!105 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !101, file: !102, line: 141, baseType: !105, size: 32, align: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !101, file: !102, line: 142, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !100, line: 120, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !111, line: 313, size: 192, align: 64, elements: !112)
!111 = !DIFile(filename: "/usr/local/include/openssl/bn.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!112 = !{!113, !116, !117, !118, !119}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !110, file: !111, line: 314, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !110, file: !111, line: 316, baseType: !105, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !110, file: !111, line: 318, baseType: !105, size: 32, align: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !110, file: !111, line: 319, baseType: !105, size: 32, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !110, file: !111, line: 320, baseType: !105, size: 32, align: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !101, file: !102, line: 143, baseType: !108, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !101, file: !102, line: 144, baseType: !122, size: 64, align: 64, offset: 192)
!122 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !101, file: !102, line: 145, baseType: !108, size: 64, align: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !101, file: !102, line: 146, baseType: !108, size: 64, align: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !101, file: !102, line: 147, baseType: !105, size: 32, align: 32, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !101, file: !102, line: 148, baseType: !127, size: 64, align: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !100, line: 123, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !111, line: 324, size: 832, align: 64, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !139}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !129, file: !111, line: 325, baseType: !105, size: 32, align: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !129, file: !111, line: 326, baseType: !109, size: 192, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !129, file: !111, line: 327, baseType: !109, size: 192, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !129, file: !111, line: 328, baseType: !109, size: 192, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !129, file: !111, line: 330, baseType: !136, size: 128, align: 64, offset: 640)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, align: 64, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 2)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !111, line: 333, baseType: !105, size: 32, align: 32, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !101, file: !102, line: 150, baseType: !108, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !101, file: !102, line: 151, baseType: !108, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !101, file: !102, line: 152, baseType: !143, size: 64, align: 64, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !101, file: !102, line: 153, baseType: !105, size: 32, align: 32, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !101, file: !102, line: 154, baseType: !108, size: 64, align: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !101, file: !102, line: 155, baseType: !105, size: 32, align: 32, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !101, file: !102, line: 156, baseType: !149, size: 128, align: 64, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !100, line: 197, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !151, line: 292, size: 128, align: 64, elements: !152)
!151 = !DIFile(filename: "/usr/local/include/openssl/crypto.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!152 = !{!153, !175}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !150, file: !151, line: 293, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !151, line: 297, size: 256, align: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !155, file: !151, line: 297, baseType: !158, size: 256, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "_STACK", file: !159, line: 72, baseType: !160)
!159 = !DIFile(filename: "/usr/local/include/openssl/stack.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !159, line: 66, size: 256, align: 64, elements: !161)
!161 = !{!162, !163, !167, !168, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !160, file: !159, line: 67, baseType: !105, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !159, line: 68, baseType: !164, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !160, file: !159, line: 69, baseType: !105, size: 32, align: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc", scope: !160, file: !159, line: 70, baseType: !105, size: 32, align: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !160, file: !159, line: 71, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!105, !173, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !150, file: !151, line: 295, baseType: !105, size: 32, align: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !101, file: !102, line: 157, baseType: !177, size: 64, align: 64, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH_METHOD", file: !100, line: 141, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_method", file: !102, line: 117, size: 576, align: 64, elements: !181)
!181 = !{!182, !185, !189, !195, !204, !205, !206, !207, !208}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !102, line: 118, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "generate_key", scope: !180, file: !102, line: 120, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!105, !98}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "compute_key", scope: !180, file: !102, line: 121, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!105, !143, !193, !98}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !180, file: !102, line: 123, baseType: !196, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!105, !199, !108, !193, !193, !193, !201, !127}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !100, line: 121, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !100, line: 121, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !180, file: !102, line: 126, baseType: !186, size: 64, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !180, file: !102, line: 127, baseType: !186, size: 64, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !180, file: !102, line: 128, baseType: !105, size: 32, align: 32, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !180, file: !102, line: 129, baseType: !165, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "generate_params", scope: !180, file: !102, line: 131, baseType: !209, size: 64, align: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!105, !98, !105, !105, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_GENCB", file: !100, line: 125, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_gencb_st", file: !111, line: 349, size: 192, align: 64, elements: !215)
!215 = !{!216, !218, !220}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !214, file: !111, line: 350, baseType: !217, size: 32, align: 32)
!217 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !214, file: !111, line: 351, baseType: !219, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !214, file: !111, line: 357, baseType: !221, size: 64, align: 64, offset: 128)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !111, line: 352, size: 64, align: 64, elements: !222)
!222 = !{!223, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "cb_1", scope: !221, file: !111, line: 354, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !105, !105, !219}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "cb_2", scope: !221, file: !111, line: 356, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!105, !105, !105, !212}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !101, file: !102, line: 158, baseType: !232, size: 64, align: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !100, line: 177, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !100, line: 177, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "cert_and_key_pairs", scope: !89, file: !90, line: 28, baseType: !236, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_cert_chain_and_key", file: !238, line: 38, size: 3008, align: 64, elements: !239)
!238 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../crypto/s2n_certificate.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!239 = !{!240, !389, !391, !392, !393}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "cert_chain", scope: !237, file: !238, line: 39, baseType: !241, size: 128, align: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_cert_chain", file: !238, line: 33, size: 128, align: 64, elements: !242)
!242 = !{!243, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "chain_size", scope: !241, file: !238, line: 34, baseType: !244, size: 32, align: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !245, line: 31, baseType: !217)
!245 = !DIFile(filename: "/usr/include/_types/_uint32_t.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!246 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !241, file: !238, line: 35, baseType: !247, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_cert", file: !238, line: 26, size: 768, align: 64, elements: !249)
!249 = !{!250, !252, !387, !388}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "cert_type", scope: !248, file: !238, line: 27, baseType: !251, size: 32, align: 32)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_cert_type", file: !35, line: 167, baseType: !34)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "public_key", scope: !248, file: !238, line: 28, baseType: !253, size: 448, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_cert_public_key", file: !35, line: 170, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_pkey", file: !255, line: 25, size: 448, align: 64, elements: !256)
!255 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../crypto/s2n_pkey.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!256 = !{!257, !349, !372, !373, !377, !378, !382}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !254, file: !255, line: 29, baseType: !258, size: 64, align: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !254, file: !255, line: 26, size: 64, align: 64, elements: !259)
!259 = !{!260, !339}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_key", scope: !258, file: !255, line: 27, baseType: !261, size: 64, align: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_rsa_key", file: !262, line: 30, size: 64, align: 64, elements: !263)
!262 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../crypto/s2n_rsa.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "rsa", scope: !261, file: !262, line: 31, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA", file: !100, line: 146, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_st", file: !268, line: 132, size: 1344, align: 64, elements: !269)
!268 = !DIFile(filename: "/usr/local/include/openssl/rsa.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!269 = !{!270, !271, !272, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !338}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !267, file: !268, line: 137, baseType: !105, size: 32, align: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !267, file: !268, line: 138, baseType: !122, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !267, file: !268, line: 139, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA_METHOD", file: !100, line: 147, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_meth_st", file: !268, line: 85, size: 896, align: 64, elements: !277)
!277 = !{!278, !279, !285, !286, !287, !288, !292, !296, !300, !301, !302, !303, !310, !314}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !268, line: 86, baseType: !183, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_enc", scope: !276, file: !268, line: 87, baseType: !280, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!105, !105, !283, !143, !265, !105}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_dec", scope: !276, file: !268, line: 89, baseType: !280, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_enc", scope: !276, file: !268, line: 91, baseType: !280, size: 64, align: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_dec", scope: !276, file: !268, line: 93, baseType: !280, size: 64, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_mod_exp", scope: !276, file: !268, line: 96, baseType: !289, size: 64, align: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!105, !108, !193, !265, !201}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !276, file: !268, line: 98, baseType: !293, size: 64, align: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!105, !108, !193, !193, !193, !201, !127}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !276, file: !268, line: 101, baseType: !297, size: 64, align: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!105, !265}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !276, file: !268, line: 103, baseType: !297, size: 64, align: 64, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !268, line: 105, baseType: !105, size: 32, align: 32, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !276, file: !268, line: 107, baseType: !165, size: 64, align: 64, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_sign", scope: !276, file: !268, line: 116, baseType: !304, size: 64, align: 64, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!105, !105, !283, !217, !143, !307, !308}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_verify", scope: !276, file: !268, line: 120, baseType: !311, size: 64, align: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!105, !105, !283, !217, !283, !217, !308}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_keygen", scope: !276, file: !268, line: 129, baseType: !315, size: 64, align: 64, offset: 832)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!105, !265, !105, !108, !212}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !267, file: !268, line: 141, baseType: !232, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !267, file: !268, line: 142, baseType: !108, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !267, file: !268, line: 143, baseType: !108, size: 64, align: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !267, file: !268, line: 144, baseType: !108, size: 64, align: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !267, file: !268, line: 145, baseType: !108, size: 64, align: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !267, file: !268, line: 146, baseType: !108, size: 64, align: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "dmp1", scope: !267, file: !268, line: 147, baseType: !108, size: 64, align: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dmq1", scope: !267, file: !268, line: 148, baseType: !108, size: 64, align: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "iqmp", scope: !267, file: !268, line: 149, baseType: !108, size: 64, align: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !267, file: !268, line: 151, baseType: !149, size: 128, align: 64, offset: 768)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !267, file: !268, line: 152, baseType: !105, size: 32, align: 32, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !267, file: !268, line: 153, baseType: !105, size: 32, align: 32, offset: 928)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_n", scope: !267, file: !268, line: 155, baseType: !127, size: 64, align: 64, offset: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_p", scope: !267, file: !268, line: 156, baseType: !127, size: 64, align: 64, offset: 1024)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_q", scope: !267, file: !268, line: 157, baseType: !127, size: 64, align: 64, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bignum_data", scope: !267, file: !268, line: 162, baseType: !165, size: 64, align: 64, offset: 1152)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "blinding", scope: !267, file: !268, line: 163, baseType: !335, size: 64, align: 64, offset: 1216)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_BLINDING", file: !100, line: 122, baseType: !337)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "bn_blinding_st", file: !100, line: 122, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mt_blinding", scope: !267, file: !268, line: 164, baseType: !335, size: 64, align: 64, offset: 1280)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ecdsa_key", scope: !258, file: !255, line: 28, baseType: !340, size: 64, align: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_ecdsa_key", file: !341, line: 31, size: 64, align: 64, elements: !342)
!341 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../crypto/s2n_ecdsa.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ec_key", scope: !340, file: !341, line: 32, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "EC_KEY", file: !346, line: 741, baseType: !347)
!346 = !DIFile(filename: "/usr/local/include/openssl/ec.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_key_st", file: !348, line: 147, flags: DIFlagFwdDecl)
!348 = !DIFile(filename: "/usr/local/include/openssl/evp.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !254, file: !255, line: 31, baseType: !350, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!105, !353, !355, !361}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_hash_state", file: !4, line: 39, size: 64, align: 32, elements: !357)
!357 = !{!358, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "alg", scope: !356, file: !4, line: 40, baseType: !359, size: 32, align: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_hash_algorithm", file: !4, line: 37, baseType: !23)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "currently_in_hash_block", scope: !356, file: !4, line: 41, baseType: !105, size: 32, align: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_blob", file: !363, line: 20, size: 192, align: 64, elements: !364)
!363 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../utils/s2n_blob.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!364 = !{!365, !369, !370, !371}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !362, file: !363, line: 21, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !368, line: 31, baseType: !144)
!368 = !DIFile(filename: "/usr/include/_types/_uint8_t.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !362, file: !363, line: 22, baseType: !244, size: 32, align: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !362, file: !363, line: 23, baseType: !244, size: 32, align: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mlocked", scope: !362, file: !363, line: 24, baseType: !217, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !254, file: !255, line: 32, baseType: !350, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !254, file: !255, line: 33, baseType: !374, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!105, !353, !361, !361}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt", scope: !254, file: !255, line: 34, baseType: !374, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !254, file: !255, line: 35, baseType: !379, size: 64, align: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!105, !353, !353}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !254, file: !255, line: 36, baseType: !383, size: 64, align: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!105, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !248, file: !238, line: 29, baseType: !362, size: 192, align: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !238, line: 30, baseType: !247, size: 64, align: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "private_key", scope: !237, file: !238, line: 40, baseType: !390, size: 448, align: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_cert_private_key", file: !35, line: 171, baseType: !254)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ocsp_status", scope: !237, file: !238, line: 41, baseType: !362, size: 192, align: 64, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sct_list", scope: !237, file: !238, line: 42, baseType: !362, size: 192, align: 64, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !237, file: !238, line: 43, baseType: !394, size: 2048, align: 8, offset: 960)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 2048, align: 8, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_preferences", scope: !89, file: !90, line: 29, baseType: !398, size: 64, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_cipher_preferences", file: !90, line: 24, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "application_protocols", scope: !89, file: !90, line: 30, baseType: !362, size: 192, align: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "status_request_type", scope: !89, file: !90, line: 31, baseType: !403, size: 32, align: 32, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_status_request_type", file: !35, line: 83, baseType: !54)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nanoseconds_since_epoch", scope: !89, file: !90, line: 32, baseType: !405, size: 64, align: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!105, !219, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !410, line: 31, baseType: !411)
!410 = !DIFile(filename: "/usr/include/_types/_uint64_t.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!411 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "data_for_nanoseconds_since_epoch", scope: !89, file: !90, line: 33, baseType: !219, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "client_hello_cb", scope: !89, file: !90, line: 35, baseType: !414, size: 64, align: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_client_hello_fn", file: !35, line: 99, baseType: !416)
!416 = !DISubroutineType(types: !417)
!417 = !{!105, !418, !219}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "client_hello_cb_ctx", scope: !89, file: !90, line: 36, baseType: !219, size: 64, align: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cache_store", scope: !89, file: !90, line: 39, baseType: !421, size: 64, align: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!105, !219, !409, !173, !409, !173, !409}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cache_store_data", scope: !89, file: !90, line: 40, baseType: !219, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cache_retrieve", scope: !89, file: !90, line: 42, baseType: !426, size: 64, align: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!105, !219, !173, !409, !219, !408}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cache_retrieve_data", scope: !89, file: !90, line: 43, baseType: !219, size: 64, align: 64, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cache_delete", scope: !89, file: !90, line: 45, baseType: !431, size: 64, align: 64, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!105, !219, !173, !409}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cache_delete_data", scope: !89, file: !90, line: 46, baseType: !219, size: 64, align: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ct_type", scope: !89, file: !90, line: 47, baseType: !436, size: 32, align: 32, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_ct_support_level", file: !35, line: 85, baseType: !58)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "client_cert_auth_type", scope: !89, file: !90, line: 49, baseType: !438, size: 32, align: 32, offset: 1120)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_cert_auth_type", file: !35, line: 136, baseType: !62)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "verify_cert_chain_cb", scope: !89, file: !90, line: 50, baseType: !440, size: 64, align: 64, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "verify_cert_trust_chain_fn", file: !35, line: 176, baseType: !442)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !418, !366, !244, !445, !446, !219}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_cert_validation_code", file: !35, line: 144, baseType: !67)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "verify_cert_context", scope: !89, file: !90, line: 51, baseType: !219, size: 64, align: 64, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mfl_code", scope: !89, file: !90, line: 53, baseType: !367, size: 8, align: 8, offset: 1280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mfl", scope: !89, file: !90, line: 56, baseType: !105, size: 32, align: 32, offset: 1312)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !85, file: !84, line: 46, baseType: !219, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !85, file: !84, line: 49, baseType: !452, size: 64, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_send_fn", file: !35, line: 108, baseType: !454)
!454 = !DISubroutineType(types: !455)
!455 = !{!105, !219, !456, !244}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !85, file: !84, line: 50, baseType: !459, size: 64, align: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_recv_fn", file: !35, line: 107, baseType: !461)
!461 = !DISubroutineType(types: !462)
!462 = !{!105, !219, !366, !244}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "send_io_context", scope: !85, file: !84, line: 53, baseType: !219, size: 64, align: 64, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "recv_io_context", scope: !85, file: !84, line: 54, baseType: !219, size: 64, align: 64, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "managed_io", scope: !85, file: !84, line: 58, baseType: !367, size: 8, align: 8, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "corked_io", scope: !85, file: !84, line: 63, baseType: !217, size: 1, align: 32, offset: 392, flags: DIFlagBitField, extraData: i64 392)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !85, file: !84, line: 66, baseType: !468, size: 32, align: 32, offset: 416)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_mode", file: !35, line: 92, baseType: !75)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "blinding", scope: !85, file: !84, line: 69, baseType: !470, size: 32, align: 32, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_blinding", file: !35, line: 117, baseType: !79)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "write_timer", scope: !85, file: !84, line: 72, baseType: !472, size: 64, align: 64, offset: 512)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_timer", file: !473, line: 20, size: 64, align: 64, elements: !474)
!473 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../utils/s2n_timer.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !472, file: !473, line: 21, baseType: !409, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !85, file: !84, line: 78, baseType: !409, size: 64, align: 64, offset: 576)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !85, file: !84, line: 81, baseType: !478, size: 256, align: 8, offset: 640)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 256, align: 8, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_len", scope: !85, file: !84, line: 82, baseType: !367, size: 8, align: 8, offset: 896)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "client_hello_version", scope: !85, file: !84, line: 87, baseType: !367, size: 8, align: 8, offset: 904)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "client_protocol_version", scope: !85, file: !84, line: 88, baseType: !367, size: 8, align: 8, offset: 912)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "server_protocol_version", scope: !85, file: !84, line: 89, baseType: !367, size: 8, align: 8, offset: 920)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "actual_protocol_version", scope: !85, file: !84, line: 90, baseType: !367, size: 8, align: 8, offset: 928)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "actual_protocol_version_established", scope: !85, file: !84, line: 91, baseType: !367, size: 8, align: 8, offset: 936)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !85, file: !84, line: 94, baseType: !488, size: 9216, align: 64, offset: 960)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_crypto_parameters", file: !489, line: 57, size: 9216, align: 64, elements: !490)
!489 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../tls/s2n_crypto.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!490 = !{!491, !492, !493, !494, !510, !511, !512, !514, !515, !516, !517, !518, !521, !666, !667, !671, !672, !673, !674, !676, !677, !678, !699, !700, !701, !705}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "server_public_key", scope: !488, file: !489, line: 58, baseType: !254, size: 448, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "client_public_key", scope: !488, file: !489, line: 59, baseType: !254, size: 448, align: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "server_dh_params", scope: !488, file: !489, line: 60, baseType: !94, size: 64, align: 64, offset: 896)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "server_ecc_params", scope: !488, file: !489, line: 61, baseType: !495, size: 128, align: 64, offset: 960)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_ecc_params", file: !496, line: 34, size: 128, align: 64, elements: !497)
!496 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../crypto/s2n_ecc.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!497 = !{!498, !509}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "negotiated_curve", scope: !495, file: !496, line: 36, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_ecc_named_curve", file: !496, line: 23, size: 128, align: 64, elements: !502)
!502 = !{!503, !507, !508}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "iana_id", scope: !501, file: !496, line: 25, baseType: !504, size: 16, align: 16)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !505, line: 31, baseType: !506)
!505 = !DIFile(filename: "/usr/include/_types/_uint16_t.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!506 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "libcrypto_nid", scope: !501, file: !496, line: 27, baseType: !105, size: 32, align: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !501, file: !496, line: 28, baseType: !183, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ec_key", scope: !495, file: !496, line: 38, baseType: !344, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "server_cert_chain", scope: !488, file: !489, line: 62, baseType: !236, size: 64, align: 64, offset: 1088)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "conn_hash_alg", scope: !488, file: !489, line: 63, baseType: !359, size: 32, align: 32, offset: 1152)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "conn_sig_alg", scope: !488, file: !489, line: 64, baseType: !513, size: 32, align: 32, offset: 1184)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_signature_algorithm", file: !48, line: 24, baseType: !47)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "client_cert_chain", scope: !488, file: !489, line: 65, baseType: !362, size: 192, align: 64, offset: 1216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "client_cert_type", scope: !488, file: !489, line: 66, baseType: !251, size: 32, align: 32, offset: 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "client_cert_hash_algorithm", scope: !488, file: !489, line: 67, baseType: !359, size: 32, align: 32, offset: 1440)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "client_cert_sig_alg", scope: !488, file: !489, line: 68, baseType: !513, size: 32, align: 32, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_suite", scope: !488, file: !489, line: 70, baseType: !519, size: 64, align: 64, offset: 1536)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_cipher_suite", file: !489, line: 70, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "client_key", scope: !488, file: !489, line: 71, baseType: !522, size: 64, align: 64, offset: 1600)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_session_key", file: !523, line: 29, size: 64, align: 64, elements: !524)
!523 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../crypto/s2n_cipher.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "evp_cipher_ctx", scope: !522, file: !523, line: 30, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !100, line: 130, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !348, line: 449, size: 1344, align: 64, elements: !529)
!529 = !{!530, !648, !649, !650, !651, !655, !656, !658, !659, !660, !661, !662, !663, !664, !665}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !528, file: !348, line: 450, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !100, line: 129, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !348, line: 308, size: 704, align: 64, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !545, !553, !557, !558, !642, !643, !647}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !534, file: !348, line: 309, baseType: !105, size: 32, align: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !534, file: !348, line: 310, baseType: !105, size: 32, align: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !534, file: !348, line: 312, baseType: !105, size: 32, align: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "iv_len", scope: !534, file: !348, line: 313, baseType: !105, size: 32, align: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !534, file: !348, line: 315, baseType: !115, size: 64, align: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !534, file: !348, line: 317, baseType: !542, size: 64, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!105, !526, !283, !283, !105}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "do_cipher", scope: !534, file: !348, line: 320, baseType: !546, size: 64, align: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!105, !526, !143, !283, !549}
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !550, line: 30, baseType: !551)
!550 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !552, line: 92, baseType: !115)
!552 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !534, file: !348, line: 323, baseType: !554, size: 64, align: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!105, !526}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_size", scope: !534, file: !348, line: 325, baseType: !105, size: 32, align: 32, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "set_asn1_parameters", scope: !534, file: !348, line: 327, baseType: !559, size: 64, align: 64, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!105, !526, !562}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !564, line: 553, baseType: !565)
!564 = !DIFile(filename: "/usr/local/include/openssl/asn1.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !564, line: 524, size: 128, align: 64, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !565, file: !564, line: 525, baseType: !105, size: 32, align: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !565, file: !564, line: 552, baseType: !569, size: 64, align: 64, offset: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !564, line: 526, size: 64, align: 64, elements: !570)
!570 = !{!571, !572, !574, !583, !594, !597, !600, !603, !606, !609, !612, !615, !618, !621, !624, !627, !630, !633, !636, !637, !638}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !569, file: !564, line: 527, baseType: !165, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !569, file: !564, line: 528, baseType: !573, size: 32, align: 32)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !100, line: 99, baseType: !105)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !569, file: !564, line: 529, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !100, line: 98, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !564, line: 239, size: 192, align: 64, elements: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !577, file: !564, line: 240, baseType: !105, size: 32, align: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !564, line: 241, baseType: !105, size: 32, align: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !577, file: !564, line: 242, baseType: !143, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !577, file: !564, line: 248, baseType: !122, size: 64, align: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !569, file: !564, line: 530, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !100, line: 103, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !564, line: 210, size: 320, align: 64, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !586, file: !564, line: 211, baseType: !183, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !586, file: !564, line: 211, baseType: !183, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !586, file: !564, line: 212, baseType: !105, size: 32, align: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !586, file: !564, line: 213, baseType: !105, size: 32, align: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !564, line: 214, baseType: !283, size: 64, align: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !586, file: !564, line: 215, baseType: !105, size: 32, align: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !569, file: !564, line: 531, baseType: !595, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !100, line: 83, baseType: !577)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !569, file: !564, line: 532, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !100, line: 84, baseType: !577)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !569, file: !564, line: 533, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !100, line: 85, baseType: !577)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !569, file: !564, line: 534, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !100, line: 86, baseType: !577)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !569, file: !564, line: 535, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !100, line: 87, baseType: !577)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !569, file: !564, line: 536, baseType: !610, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !100, line: 88, baseType: !577)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !569, file: !564, line: 537, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !100, line: 89, baseType: !577)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !569, file: !564, line: 538, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !100, line: 90, baseType: !577)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !569, file: !564, line: 539, baseType: !619, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !100, line: 92, baseType: !577)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !569, file: !564, line: 540, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !100, line: 91, baseType: !577)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !569, file: !564, line: 541, baseType: !625, size: 64, align: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !100, line: 93, baseType: !577)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !569, file: !564, line: 542, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !100, line: 95, baseType: !577)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !569, file: !564, line: 543, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !100, line: 96, baseType: !577)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !569, file: !564, line: 544, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !100, line: 97, baseType: !577)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !569, file: !564, line: 549, baseType: !575, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !569, file: !564, line: 550, baseType: !575, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !569, file: !564, line: 551, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !564, line: 299, baseType: !641)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !564, line: 299, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "get_asn1_parameters", scope: !534, file: !348, line: 329, baseType: !559, size: 64, align: 64, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !534, file: !348, line: 331, baseType: !644, size: 64, align: 64, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!105, !526, !105, !105, !219}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !534, file: !348, line: 333, baseType: !219, size: 64, align: 64, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !528, file: !348, line: 451, baseType: !232, size: 64, align: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !528, file: !348, line: 453, baseType: !105, size: 32, align: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !528, file: !348, line: 454, baseType: !105, size: 32, align: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "oiv", scope: !528, file: !348, line: 455, baseType: !652, size: 128, align: 8, offset: 192)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 128, align: 8, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 16)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !528, file: !348, line: 456, baseType: !652, size: 128, align: 8, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !528, file: !348, line: 457, baseType: !657, size: 256, align: 8, offset: 448)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 256, align: 8, elements: !479)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !528, file: !348, line: 458, baseType: !105, size: 32, align: 32, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !528, file: !348, line: 459, baseType: !219, size: 64, align: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !528, file: !348, line: 460, baseType: !105, size: 32, align: 32, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !528, file: !348, line: 461, baseType: !115, size: 64, align: 64, offset: 896)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_data", scope: !528, file: !348, line: 462, baseType: !219, size: 64, align: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "final_used", scope: !528, file: !348, line: 463, baseType: !105, size: 32, align: 32, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "block_mask", scope: !528, file: !348, line: 464, baseType: !105, size: 32, align: 32, offset: 1056)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !528, file: !348, line: 465, baseType: !657, size: 256, align: 8, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "server_key", scope: !488, file: !489, line: 72, baseType: !522, size: 64, align: 64, offset: 1664)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_premaster_secret", scope: !488, file: !489, line: 74, baseType: !668, size: 384, align: 8, offset: 1728)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 384, align: 8, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 48)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "master_secret", scope: !488, file: !489, line: 75, baseType: !668, size: 384, align: 8, offset: 2112)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "client_random", scope: !488, file: !489, line: 76, baseType: !478, size: 256, align: 8, offset: 2496)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "server_random", scope: !488, file: !489, line: 77, baseType: !478, size: 256, align: 8, offset: 2752)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "client_implicit_iv", scope: !488, file: !489, line: 78, baseType: !675, size: 128, align: 8, offset: 3008)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 128, align: 8, elements: !653)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "server_implicit_iv", scope: !488, file: !489, line: 79, baseType: !675, size: 128, align: 8, offset: 3136)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "signature_hash", scope: !488, file: !489, line: 81, baseType: !356, size: 64, align: 32, offset: 3264)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "client_record_mac", scope: !488, file: !489, line: 82, baseType: !679, size: 1920, align: 32, offset: 3328)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_hmac_state", file: !12, line: 34, size: 1920, align: 32, elements: !680)
!680 = !{!681, !683, !684, !685, !686, !687, !688, !689, !690, !691, !695}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "alg", scope: !679, file: !12, line: 35, baseType: !682, size: 32, align: 32)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "s2n_hmac_algorithm", file: !12, line: 32, baseType: !11)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "hash_block_size", scope: !679, file: !12, line: 37, baseType: !504, size: 16, align: 16, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "currently_in_hash_block", scope: !679, file: !12, line: 38, baseType: !244, size: 32, align: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "xor_pad_size", scope: !679, file: !12, line: 39, baseType: !504, size: 16, align: 16, offset: 96)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "digest_size", scope: !679, file: !12, line: 40, baseType: !367, size: 8, align: 8, offset: 112)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !679, file: !12, line: 42, baseType: !356, size: 64, align: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "inner_just_key", scope: !679, file: !12, line: 43, baseType: !356, size: 64, align: 32, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !679, file: !12, line: 44, baseType: !356, size: 64, align: 32, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "outer_just_key", scope: !679, file: !12, line: 45, baseType: !356, size: 64, align: 32, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "xor_pad", scope: !679, file: !12, line: 49, baseType: !692, size: 1024, align: 8, offset: 384)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 1024, align: 8, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "digest_pad", scope: !679, file: !12, line: 52, baseType: !696, size: 512, align: 8, offset: 1408)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 512, align: 8, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "server_record_mac", scope: !488, file: !489, line: 83, baseType: !679, size: 1920, align: 32, offset: 5248)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "record_mac_copy_workspace", scope: !488, file: !489, line: 84, baseType: !679, size: 1920, align: 32, offset: 7168)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "client_sequence_number", scope: !488, file: !489, line: 85, baseType: !702, size: 64, align: 8, offset: 9088)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 64, align: 8, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 8)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "server_sequence_number", scope: !488, file: !489, line: 86, baseType: !702, size: 64, align: 8, offset: 9152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !85, file: !84, line: 95, baseType: !488, size: 9216, align: 64, offset: 10176)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !85, file: !84, line: 98, baseType: !708, size: 64, align: 64, offset: 19392)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !85, file: !84, line: 99, baseType: !708, size: 64, align: 64, offset: 19456)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prf_space", scope: !85, file: !84, line: 102, baseType: !711, size: 3648, align: 64, offset: 19520)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_prf_working_space", file: !712, line: 34, size: 3648, align: 64, elements: !713)
!712 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../tls/s2n_prf.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!713 = !{!714, !847}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !711, file: !712, line: 40, baseType: !715, size: 3200, align: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !711, file: !712, line: 35, size: 3200, align: 64, elements: !716)
!716 = !{!717, !742, !845, !846}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "p_hash_hmac_impl", scope: !715, file: !712, line: 36, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_p_hash_hmac", file: !712, line: 52, size: 448, align: 64, elements: !721)
!721 = !{!722, !727, !731, !735, !739, !740, !741}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !720, file: !712, line: 53, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!105, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !720, file: !712, line: 54, baseType: !728, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!105, !726, !682, !361}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !720, file: !712, line: 55, baseType: !732, size: 64, align: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!105, !726, !173, !244}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !720, file: !712, line: 56, baseType: !736, size: 64, align: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64, align: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!105, !726, !219, !244}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !720, file: !712, line: 57, baseType: !723, size: 64, align: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !720, file: !712, line: 58, baseType: !723, size: 64, align: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !720, file: !712, line: 59, baseType: !723, size: 64, align: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "p_hash", scope: !715, file: !712, line: 37, baseType: !743, size: 2112, align: 64, offset: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "p_hash_state", file: !712, line: 29, size: 2112, align: 64, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "s2n_hmac", scope: !743, file: !712, line: 30, baseType: !679, size: 1920, align: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "evp_hmac", scope: !743, file: !712, line: 31, baseType: !747, size: 192, align: 64, offset: 1920)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_evp_hmac_state", file: !748, line: 27, size: 192, align: 64, elements: !749)
!748 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../crypto/s2n_evp.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!749 = !{!750, !814}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "evp_digest", scope: !747, file: !748, line: 28, baseType: !751, size: 128, align: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_evp_digest", file: !748, line: 22, size: 128, align: 64, elements: !752)
!752 = !{!753, !813}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !751, file: !748, line: 23, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !100, line: 131, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_md_st", file: !348, line: 160, size: 960, align: 64, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !783, !784, !788, !794, !795, !799, !803, !807, !808, !809}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !757, file: !348, line: 161, baseType: !105, size: 32, align: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_type", scope: !757, file: !348, line: 162, baseType: !105, size: 32, align: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "md_size", scope: !757, file: !348, line: 163, baseType: !105, size: 32, align: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !757, file: !348, line: 164, baseType: !115, size: 64, align: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !757, file: !348, line: 165, baseType: !764, size: 64, align: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64, align: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!105, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !100, line: 132, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_md_ctx_st", file: !348, line: 268, size: 384, align: 64, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !779}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !769, file: !348, line: 269, baseType: !754, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !769, file: !348, line: 270, baseType: !232, size: 64, align: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !769, file: !348, line: 272, baseType: !115, size: 64, align: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "md_data", scope: !769, file: !348, line: 273, baseType: !219, size: 64, align: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !769, file: !348, line: 275, baseType: !776, size: 64, align: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_CTX", file: !100, line: 138, baseType: !778)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_ctx_st", file: !100, line: 138, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !769, file: !348, line: 277, baseType: !780, size: 64, align: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!105, !767, !173, !549}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !757, file: !348, line: 166, baseType: !780, size: 64, align: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !757, file: !348, line: 167, baseType: !785, size: 64, align: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!105, !767, !143}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !757, file: !348, line: 168, baseType: !789, size: 64, align: 64, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64, align: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!105, !767, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !757, file: !348, line: 169, baseType: !764, size: 64, align: 64, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !757, file: !348, line: 171, baseType: !796, size: 64, align: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!105, !105, !283, !217, !143, !307, !219}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !757, file: !348, line: 173, baseType: !800, size: 64, align: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!105, !105, !283, !217, !283, !217, !219}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "required_pkey_type", scope: !757, file: !348, line: 176, baseType: !804, size: 160, align: 32, offset: 640)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 160, align: 32, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 5)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !757, file: !348, line: 177, baseType: !105, size: 32, align: 32, offset: 800)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_size", scope: !757, file: !348, line: 178, baseType: !105, size: 32, align: 32, offset: 832)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "md_ctrl", scope: !757, file: !348, line: 180, baseType: !810, size: 64, align: 64, offset: 896)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!105, !767, !105, !105, !219}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !751, file: !748, line: 24, baseType: !767, size: 64, align: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mac_key", scope: !747, file: !748, line: 29, baseType: !815, size: 64, align: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !100, line: 133, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !348, line: 129, size: 448, align: 64, elements: !818)
!818 = !{!819, !820, !821, !822, !827, !828, !841, !842}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !817, file: !348, line: 130, baseType: !105, size: 32, align: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "save_type", scope: !817, file: !348, line: 131, baseType: !105, size: 32, align: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !817, file: !348, line: 132, baseType: !105, size: 32, align: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ameth", scope: !817, file: !348, line: 133, baseType: !823, size: 64, align: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_ASN1_METHOD", file: !100, line: 135, baseType: !826)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_asn1_method_st", file: !100, line: 135, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !817, file: !348, line: 134, baseType: !232, size: 64, align: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !817, file: !348, line: 149, baseType: !829, size: 64, align: 64, offset: 256)
!829 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !817, file: !348, line: 135, size: 64, align: 64, elements: !830)
!830 = !{!831, !832, !834, !837, !839}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !829, file: !348, line: 136, baseType: !165, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rsa", scope: !829, file: !348, line: 138, baseType: !833, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dsa", scope: !829, file: !348, line: 141, baseType: !835, size: 64, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64, align: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "dsa_st", file: !100, line: 143, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "dh", scope: !829, file: !348, line: 144, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ec", scope: !829, file: !348, line: 147, baseType: !840, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "save_parameters", scope: !817, file: !348, line: 150, baseType: !105, size: 32, align: 32, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !817, file: !348, line: 151, baseType: !843, size: 64, align: 64, offset: 384)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64, align: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !348, line: 151, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "digest0", scope: !715, file: !712, line: 38, baseType: !696, size: 512, align: 8, offset: 2176)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "digest1", scope: !715, file: !712, line: 39, baseType: !696, size: 512, align: 8, offset: 2688)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ssl3", scope: !711, file: !712, line: 47, baseType: !848, size: 416, align: 32, offset: 3200)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !711, file: !712, line: 42, size: 416, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "md5", scope: !848, file: !712, line: 43, baseType: !356, size: 64, align: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "sha1", scope: !848, file: !712, line: 44, baseType: !356, size: 64, align: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "md5_digest", scope: !848, file: !712, line: 45, baseType: !675, size: 128, align: 8, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sha1_digest", scope: !848, file: !712, line: 46, baseType: !854, size: 160, align: 8, offset: 256)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 160, align: 8, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 20)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "client_cert_auth_type_overridden", scope: !85, file: !84, line: 109, baseType: !367, size: 8, align: 8, offset: 23168)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "client_cert_auth_type", scope: !85, file: !84, line: 113, baseType: !438, size: 32, align: 32, offset: 23200)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "header_in_data", scope: !85, file: !84, line: 118, baseType: !860, size: 40, align: 8, offset: 23232)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 40, align: 8, elements: !805)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "header_in", scope: !85, file: !84, line: 119, baseType: !862, size: 320, align: 64, offset: 23296)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_stuffer", file: !863, line: 23, size: 320, align: 64, elements: !864)
!863 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../stuffer/s2n_stuffer.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!864 = !{!865, !866, !867, !868, !869, !870, !871}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !862, file: !863, line: 25, baseType: !362, size: 192, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "read_cursor", scope: !862, file: !863, line: 28, baseType: !244, size: 32, align: 32, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "write_cursor", scope: !862, file: !863, line: 29, baseType: !244, size: 32, align: 32, offset: 224)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "wiped", scope: !862, file: !863, line: 33, baseType: !217, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "alloced", scope: !862, file: !863, line: 36, baseType: !217, size: 1, align: 32, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "growable", scope: !862, file: !863, line: 39, baseType: !217, size: 1, align: 32, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tainted", scope: !862, file: !863, line: 42, baseType: !217, size: 1, align: 32, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !85, file: !84, line: 120, baseType: !862, size: 320, align: 64, offset: 23616)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !85, file: !84, line: 121, baseType: !862, size: 320, align: 64, offset: 23936)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "in_status", scope: !85, file: !84, line: 122, baseType: !83, size: 32, align: 32, offset: 24256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "current_user_data_consumed", scope: !85, file: !84, line: 128, baseType: !876, size: 64, align: 64, offset: 24320)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !877, line: 30, baseType: !878)
!877 = !DIFile(filename: "/usr/include/sys/_types/_ssize_t.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !552, line: 119, baseType: !122)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "alert_in_data", scope: !85, file: !84, line: 133, baseType: !880, size: 16, align: 8, offset: 24384)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 16, align: 8, elements: !137)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "alert_in", scope: !85, file: !84, line: 134, baseType: !862, size: 320, align: 64, offset: 24448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "reader_alert_out_data", scope: !85, file: !84, line: 144, baseType: !880, size: 16, align: 8, offset: 24768)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "writer_alert_out_data", scope: !85, file: !84, line: 145, baseType: !880, size: 16, align: 8, offset: 24784)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "reader_alert_out", scope: !85, file: !84, line: 146, baseType: !862, size: 320, align: 64, offset: 24832)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "writer_alert_out", scope: !85, file: !84, line: 147, baseType: !862, size: 320, align: 64, offset: 25152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "close_notify_queued", scope: !85, file: !84, line: 150, baseType: !217, size: 1, align: 32, offset: 25472, flags: DIFlagBitField, extraData: i64 25472)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "handshake", scope: !85, file: !84, line: 153, baseType: !888, size: 1728, align: 64, offset: 25536)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2n_handshake", file: !889, line: 47, size: 1728, align: 64, elements: !890)
!889 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../tls/s2n_handshake.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !907, !908, !909, !910}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !888, file: !889, line: 48, baseType: !862, size: 320, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "md5", scope: !888, file: !889, line: 50, baseType: !356, size: 64, align: 32, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "sha1", scope: !888, file: !889, line: 51, baseType: !356, size: 64, align: 32, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "sha224", scope: !888, file: !889, line: 52, baseType: !356, size: 64, align: 32, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !888, file: !889, line: 53, baseType: !356, size: 64, align: 32, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "sha384", scope: !888, file: !889, line: 54, baseType: !356, size: 64, align: 32, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "sha512", scope: !888, file: !889, line: 55, baseType: !356, size: 64, align: 32, offset: 640)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "md5_sha1", scope: !888, file: !889, line: 56, baseType: !356, size: 64, align: 32, offset: 704)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "prf_md5_hash_copy", scope: !888, file: !889, line: 59, baseType: !356, size: 64, align: 32, offset: 768)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "prf_sha1_hash_copy", scope: !888, file: !889, line: 60, baseType: !356, size: 64, align: 32, offset: 832)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "prf_tls12_hash_copy", scope: !888, file: !889, line: 62, baseType: !356, size: 64, align: 32, offset: 896)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "required_hash_algs", scope: !888, file: !889, line: 67, baseType: !702, size: 64, align: 8, offset: 960)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "server_finished", scope: !888, file: !889, line: 69, baseType: !904, size: 288, align: 8, offset: 1024)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 288, align: 8, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 36)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "client_finished", scope: !888, file: !889, line: 70, baseType: !904, size: 288, align: 8, offset: 1312)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_type", scope: !888, file: !889, line: 74, baseType: !105, size: 32, align: 32, offset: 1600)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "message_number", scope: !888, file: !889, line: 101, baseType: !105, size: 32, align: 32, offset: 1632)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_failed", scope: !888, file: !889, line: 104, baseType: !367, size: 8, align: 8, offset: 1664)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "max_outgoing_fragment_length", scope: !85, file: !84, line: 165, baseType: !504, size: 16, align: 16, offset: 27264)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mfl_code", scope: !85, file: !84, line: 168, baseType: !367, size: 8, align: 8, offset: 27280)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "wire_bytes_in", scope: !85, file: !84, line: 171, baseType: !409, size: 64, align: 64, offset: 27328)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "wire_bytes_out", scope: !85, file: !84, line: 172, baseType: !409, size: 64, align: 64, offset: 27392)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "closing", scope: !85, file: !84, line: 187, baseType: !916, size: 32, align: 32, offset: 27456)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !917, line: 39, baseType: !105)
!917 = !DIFile(filename: "/usr/include/i386/signal.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!918 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !85, file: !84, line: 188, baseType: !916, size: 32, align: 32, offset: 27488)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !85, file: !84, line: 191, baseType: !394, size: 2048, align: 8, offset: 27520)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "application_protocol", scope: !85, file: !84, line: 198, baseType: !394, size: 2048, align: 8, offset: 29568)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "secure_renegotiation", scope: !85, file: !84, line: 205, baseType: !217, size: 1, align: 32, offset: 31616, flags: DIFlagBitField, extraData: i64 31616)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "status_type", scope: !85, file: !84, line: 208, baseType: !403, size: 32, align: 32, offset: 31648)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "status_response", scope: !85, file: !84, line: 209, baseType: !362, size: 192, align: 64, offset: 31680)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ct_level_requested", scope: !85, file: !84, line: 212, baseType: !436, size: 32, align: 32, offset: 31872)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ct_response", scope: !85, file: !84, line: 213, baseType: !362, size: 192, align: 64, offset: 31936)
!926 = !{!927, !928}
!927 = !DIEnumerator(name: "ENCRYPTED", value: 0)
!928 = !DIEnumerator(name: "PLAINTEXT", value: 1)
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !931, retainedTypes: !1041)
!930 = !DIFile(filename: "crypto/s2n_hmac.c", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!931 = !{!11, !23, !932}
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 41, size: 32, align: 32, elements: !934)
!933 = !DIFile(filename: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc/../../../../error/s2n_errno.h", directory: "/Users/dsn/github/s2n/tests/sidewinder/working/s2n-cbc")
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!935 = !DIEnumerator(name: "S2N_ERR_OK", value: 0)
!936 = !DIEnumerator(name: "S2N_ERR_IO", value: 67108864)
!937 = !DIEnumerator(name: "S2N_ERR_CLOSED", value: 134217728)
!938 = !DIEnumerator(name: "S2N_ERR_BLOCKED", value: 201326592)
!939 = !DIEnumerator(name: "S2N_ERR_ALERT", value: 268435456)
